Revit 2018 API
Pipe.CreatePlaceholder Method
 Creates a new placeholder pipe.
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 18.0.0.0 (18.0.0.0)
Since: 2014
Syntax
C#
public static Pipe CreatePlaceholder(
	Document document,
	ElementId systemTypeId,
	ElementId pipeTypeId,
	ElementId levelId,
	XYZ startPoint,
	XYZ endPoint
)
Visual Basic
Public Shared Function CreatePlaceholder ( _
	document As Document, _
	systemTypeId As ElementId, _
	pipeTypeId As ElementId, _
	levelId As ElementId, _
	startPoint As XYZ, _
	endPoint As XYZ _
) As Pipe
Visual C++
public:
static Pipe^ CreatePlaceholder(
	Document^ document,
	ElementId^ systemTypeId,
	ElementId^ pipeTypeId,
	ElementId^ levelId,
	XYZ^ startPoint,
	XYZ^ endPoint
)
Parameters
document
Type: Autodesk.Revit.DB.Document
 The document.
systemTypeId
Type: Autodesk.Revit.DB.ElementId
 The ElementId of the piping system type.
pipeTypeId
Type: Autodesk.Revit.DB.ElementId
 The ElementId of the pipe type.
levelId
Type: Autodesk.Revit.DB.ElementId
 The level id for the pipe.
startPoint
Type: Autodesk.Revit.DB.XYZ
 The first point of the placeholder line.
endPoint
Type: Autodesk.Revit.DB.XYZ
 The second point of the placeholder line.
Return Value
 The placeholder pipe.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  The systemTypeId is not valid piping system type. -or- The pipe type pipeTypeId is not valid pipe type. -or- The level id levelId is not valid. -or- The points of startPoint and endPoint are equal.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was NULL
Autodesk.Revit.Exceptions.DisabledDisciplineException |  None of the following disciplines is enabled: Mechanical Electrical Piping.
See Also
Pipe Class
Autodesk.Revit.DB.Plumbing Namespace